package games.fieldOfDreams;

import lombok.Getter;

import java.util.Random;

/**
 * Слова для игры
 */
@Getter
public class Words {

    /**
     * Список слов
     */
    private final static String[] WORDS = {
            "баг", "фича", "тестирование", "продакшен", "дебаг", "регрессия", "коммит", "ревью", "ассерты",
            "логирование", "кодфриз", "рефакторинг", "деплой", "докер", "селенид", "джира", "скрам", "бэклог",
            "автотест", "мокирование", "патч", "хотфикс", "покрытие", "версионирование", "песочница",
            "реквест", "плейсхолдер", "гипотенуза", "ангуляр", "реакт", "стресс", "локализация", "эксепшн",
            "стаб", "фейл", "фолс", "правда", "реверс", "костыль", "говнокод", "краш", "юзабилити", "сейв",
            "джава", "питон", "библиотека", "сервис", "фронтенд", "бекенд", "внедрение", "контроль",
            "мерж", "протухание", "санитайзер", "эксплойт", "анализ", "клик", "интеграция", "блокер",
            "срочняк", "тайминг", "апрув", "таск", "флоу", "грейд", "чеклист", "тулчейн", "пейджинг",
            "интерфейс", "фичафлаг", "мидлварь", "тесткейс", "багрепорт", "оверлей", "парсер", "фрод",
            "дедлайн", "кластер", "падение", "абстракция", "инкапсуляция", "инъекция", "залипуха", "котлин"
    };

    /**
     * Получить случайное слово для игры
     */
    public static String getRandomWord() {
        return WORDS[new Random().nextInt(WORDS.length)];
    }
}